LEXICON = {
    'lack_channels': """❌ У вас не добавлен ни один канал, чтобы добавить канал в бота, нажмите кнопку "Мои каналы 📢""",
    'start_message': """Создание розыгрыш\n
                    ✉️ Отправьте текст для розыгрыша. Вы можете также отправить вместе с текстом картинку, видео или GIF,
                     пользоваться разметкой.
                    ❗️ Вы можете использовать только 1 медиафайл\n
                    Бот для проведения конкурсов полностью бесплатный, прозрачный и без рекламы, ему будет приятно, если в конкурсном посте 
                    Вы укажите на него ссылку, спасибо. @Random1zeBot""",
    'add_text_button': """📰 Отправьте текст, который будет отображаться на кнопке,
                        или выберите один из вариантов кнопкой:""",
    'add_channel_raffle': """📊 Добавьте каналы, на которые пользователям нужно будет подписаться для участия в розыгрыше.
                                Подписка на канал, в котором проводится розыгрыш, обязательна и включена по умолчанию.
                                Чтобы добавить канал, нужно:
                                1. Добавить бота (@Random1zeBot) в ваш канал как администратора (это нужно, чтобы бот мог проверить подписан ли пользователь на канал).
                                2. Отправить боту канал в формате @channelname (или переслать сообщение из канала).
                                ⚠️ Если вы хотите чтобы участвовать в розыгрыше можно было без подписок на канал, нажмите кнопку ниже:""",
    'true_add_channel': """✅ Канал добавлен, вы можете добавить еще один 
                            (просто продолжайте присылать каналы) или продолжить создание розыгрыша:\n\n 
                            <b>Не забирайте у бота права администратора канала, 
                            иначе проверка подписки происходить не будет!</b>""",
    'support': """ℹ️ Если возникли трудности, прочитайте инструкцию по работе с ботом.
                    Инструкция - https://cutt.ly/21DTeSP\n
                    ⚙️ Если полностью прочитали инструкцию и остались вопросы,
                    пишите @FeedBackRandom1zeBot (ответ не моментальный, а по возможности)""",
    'stair': """Перед вами бесплатный конкурсный бот с полезным маркетинговым функционалом. 🎲\n
            Если Вам нравится бот и Вы готовы его поддержать, то Вы можете это сделать, воспользовавшись ссылкой ниже. 💜\n
            И пусть удача Вам помогает по жизни так же, как вы помогаете Randomize Боту. 🍀\n
            https://donate.stream/yoomoney410013300166475""",
    'instruction': """<b>Инструкция</b>\n
                    Добавьте бота (@djwehebot) в ваш канал или чат как администратора с правом публикации сообщений.
                    \n
                    ⚠️ Если вы хотите использовать бота в группе (чате), обязательно выдайте ему право писать в ней.
                    """,
    'instruction_add_channel': """📊 Добавьте каналы, на которые пользователям нужно будет подписаться для участия в розыгрыше.
                                Подписка на канал, в котором проводится розыгрыш, обязательна и включена по умолчанию.
                            
                                Чтобы добавить канал, нужно:
                                1. Добавить бота (@Random1zeBot) в ваш канал как администратора (это нужно, чтобы бот мог проверить подписан ли пользователь на канал).
                                2. Отправить боту канал в формате @channelname (или переслать сообщение из канала).
                            
                                ⚠️ Если вы хотите чтобы участвовать в розыгрыше можно было без подписок на канал, нажмите кнопку ниже:"""
}
